# DONE: РќСѓР¶РЅРѕ С‡С‚РѕР±С‹ С‚РµРєСЃС‚ РѕРґРЅРёРј РєСѓСЃРєРѕРј РїСЂРѕРєСЂСѓС‡РёРІР°Р»СЃСЏ СЃРЅРёР·Сѓ РІРІРµСЂС… РЅР° С„РѕРЅРµ РјРµРЅСЏСЋС‰РёС…СЃСЏ РєР°СЂС‚РёРЅРѕРє. Р С‡С‚РѕР±С‹ С‚РµРєСЃС‚ РЅРѕСЂРјР°Р»СЊРЅРѕ С‡РёС‚Р°Р»СЃСЏ РЅСѓР¶РЅРѕ Р»РёР±Рѕ РѕР±РІРµСЃС‚Рё Р±СѓРєРІС‹, Р»РёР±Рѕ СЃРґРµР»Р°С‚СЊ РїРѕРґР»РѕР¶РєСѓ.
# DONE: РќСѓР¶РЅРѕ С‡С‚РѕР±С‹ РїСЂРё РЅР°Р¶Р°С‚РёРё esc Рё РїСЂРѕС‡РёС… РІС‹Р·РѕРІРѕРІ РјРµРЅСЋ РїСЂРѕРєСЂСѓС‚РєР° РѕСЃС‚Р°РЅР°РІР»РёРІР°Р»Р°СЃСЊ.
    
transform bottom_to_top:                #РўСЂР°РЅСЃС„РѕСЂРј РїСЂРѕРєСЂСѓС‡РёРІР°СЋС‰РёР№ С‚РµРєСЃС‚
        ypos 720 xalign 0.5             #РќР°С‡Р°Р»СЊРЅРѕРµ РїРѕР»РѕР¶РµРЅРёРµ С‚РµРєСЃС‚Р° - РїРѕ РІРµСЂС‚РёРєР°Р»Рё СѓР±СЂР°РЅ Р·Р°РЅРёР¶РЅРёР№ РєСЂР°Р№ Рё РІС‹СЂРѕРІРЅРµРЅ РїРѕСЃРµСЂРµРґРёРЅРµ
        linear 90.0 ypos 0 yanchor 1.0  #Р—Р° 90 СЃРµРєСѓРЅРґ РїРѕРґРЅРёРјР°РµРј С‚РµРєСЃС‚ РґРѕ РІРµСЂС…РЅРµР№ РєСЂРѕРјРєРё Рё СЃРјРµС‰Р°РµРј СЏРєРѕСЂСЊ (РїРѕ РєРѕС‚РѕСЂРѕРјСѓ РІС‹СЃС‡РёС‚С‹РІР°РµС‚СЃСЏ РїРѕР»РѕР¶РµРЅРёРµ С‚РµРєСЃС‚Р°)

transform intro_bg:
    "intro 1"                   #РќР°С‡Р°Р»СЊРЅР°СЏ РєР°СЂС‚РёРЅРєР° (РЅСѓР¶РЅР° С‡С‚РѕР±С‹ РїРѕРєР°Р·Р°С‚СЊ РµРµ РµСЃР»Рё РїРѕС€РµР» РїРѕРІС‚РѕСЂ
    pause 10                    #Р—Р°РґРµСЂР¶РєР° РїРµСЂРµРґ СЃР»РµРґСѓС‰РµР№ РєР°СЂС‚РёРЅРєРѕР№
    "intro 2" with dissolve     #РџРѕРєР°Р·С‹РІР°РµРј СЃР»РµРґСѓС‰СѓСЋ РєР°СЂС‚РёРЅРєСѓ
    pause 10
    "intro 3" with dissolve
    pause 10
    "intro 4" with dissolve
    pause 10
    "intro 5" with dissolve
    pause 10
    "intro 6" with dissolve
    pause 10
    "intro 7" with dissolve
    pause 10
    "intro 8" with dissolve
    pause 10
    repeat                      #РџРѕРІС‚РѕСЂСЏРµРј РїРѕ РєСЂСѓРіСѓ
    
screen sc_intro:
    add "intro 1" at intro_bg           #РџРѕРєР°Р·С‹РІР°РµРј С„РѕРЅ Рё РґРѕР±Р°РІР»СЏРµРј С‚СЂР°РЅСЃС„РѕСЂРј С‡С‚РѕР±С‹ РѕРЅ РјРµРЅСЏР»СЃСЏ РїРѕ С…РѕРґСѓ СЃС†РµРЅС‹
    text intro_text at bottom_to_top:   #Р”РѕР±Р°РІР»СЏРµРј С‚РµРєСЃС‚ (РѕРїСЂРµРґРµР»РµРЅ РІ text.py) СЃ РїСЂРѕРєСЂСѓС‚РєРѕР№
        first_indent 30                 #РћС‚СЃС‚СѓРї РґР»СЏ РїРµСЂРІРѕР№ СЃС‚СЂРѕРєРё РІ РїР°СЂР°РіСЂР°С„Рµ
        newline_indent True             #РќСѓР¶РЅРѕ РїСЂРёРјРµРЅСЏС‚СЊ РѕС‚СЃС‚СѓРї РґР»СЏ РєР°Р¶РґРѕР№ РїРµСЂРІРѕР№ СЃС‚СЂРѕРєРё РІ РїР°СЂР°РіСЂР°С„Рµ.
        layout "tex"                    #Р Р°Р·Р±РёРІРєР° С‚РµРєСЃС‚Р° РЅР° СЃС‚СЂРѕРєРё
        justify True                    #Р’С‹СЂРѕРІРЅСЏС‚СЊ С‚РµРєСЃС‚ РїРѕ С€РёСЂРёРЅРµ
        outlines [(1, "#0008", 1, 1)]   #РћР±РІРѕРґРєР° С‚РµРєСЃС‚Р°, РёРЅР°С‡Рµ РµРіРѕ РїР»РѕС…Рѕ РІРёРґРЅРѕ
        xmaximum 900                    #РњР°РєСЃРёРјР°Р»СЊРЅР°СЏ С€РёСЂРёРЅР° С‚РµРєСЃС‚Р°
        '''
            РљСЃС‚Р°С‚Рё, РІ СЂРµРЅРїРё РµСЃС‚СЊ Р±Р°Рі, РЅРµ СЂР°Р±РѕС‚Р°РµС‚ newline_indent, 
            РЅРѕ РµСЃР»Рё РµРіРѕ РїРѕС‡РёРЅРёС‚СЊ, С‚Рѕ С‚РµРєСЃС‚ РєСЂРёРІРѕ СЂР°Р·Р±РёРІР°РµС‚СЃСЏ РЅР° СЃС‚СЂРѕРєРё
            РІ layout "tex".
        '''
    
    #РќР°Р·РЅР°С‡Р°РµРј РєРЅРѕРїРєРё, С‡С‚РѕР±С‹ РІРµСЂРЅСѓС‚СЊСЃСЏ СЃ СЌС‚РѕРіРѕ СЌРєСЂР°РЅР°.
    key "K_SPACE" action Return()
    key 'K_RETURN' action Return()
    key 'K_KP_ENTER' action Return()
    key "mousedown_1" action Return()